[
  {
    "id": "1",
    "title": "3D Animator",
    "description": "Location: [Your Office Location or Remote]<br />Team: Animation<br />Experience Level: Mid to Senior Level<br /><br />🐝 About the Role<br />Beeyoond is seeking a passionate and creative 3D Animator to join our buzzing animation team. You’ll breathe life into characters, environments, and visual effects, working closely with game designers, modelers, and developers to craft stunning, immersive experiences for our games and media content.<br /><br />🔧 Responsibilities<br />Create high-quality 3D animations for characters, environments, and objects using Maya, Blender, or equivalent tools.<br />Work closely with art directors and concept artists to understand and translate creative vision into fluid animations.<br />Collaborate with rigging artists to ensure characters and assets are animation-ready.<br />Integrate animations into game engines (e.g., Unity, Unreal) and troubleshoot technical issues.<br />Maintain consistency with the visual style of the project and meet production deadlines.<br />Participate in reviews and iterate based on feedback.<br /><br />🧠 Requirements<br />2+ years of experience as a 3D animator in games, film, or interactive media.<br />Proficiency in Maya, Blender, or similar 3D animation software.<br />Strong understanding of timing, weight, movement, and character performance.<br />Experience with animation pipelines and asset integration in game engines.<br />Basic knowledge of rigging and skinning.<br />Good communication and teamwork skills.<br />Portfolio or demo reel showcasing your best animation work.<br /><br />⭐ Nice to Have<br />Experience with motion capture cleanup and retargeting.<br />Familiarity with real-time rendering workflows.<br />Knowledge of scripting (Python/MEL) for animation tools."
  },
  {
    "id": "2",
    "title": "Unity Game Developer",
    "description": "Location: [Your Office Location or Remote]<br />Team: Game Development<br />Experience Level: Mid Level<br /><br />🎮 About the Role<br />We are looking for a skilled Unity Game Developer to join our dynamic team and help build engaging, immersive gaming experiences using Unity3D.<br /><br />🔧 Responsibilities<br />Develop, test, and maintain high-quality games and interactive experiences using Unity3D.<br />Collaborate with designers, artists, and other developers to implement game mechanics, UI, and features.<br />Optimize game performance across multiple platforms.<br />Troubleshoot and debug issues to ensure smooth gameplay.<br />Stay up-to-date with the latest gaming trends and technologies.<br /><br />🧠 Requirements<br />Strong proficiency in Unity3D and C# scripting.<br />Experience with game development lifecycle including design, implementation, and testing.<br />Understanding of 3D mathematics, physics, and animation principles.<br />Familiarity with version control systems (e.g., Git).<br />Ability to work well in a collaborative team environment.<br /><br />⭐ Preferred Qualifications<br />Experience with multiplayer networking and online game integration.<br />Knowledge of shader programming and optimization techniques.<br />Experience deploying games on multiple platforms (PC, mobile, consoles)."
  },
  {
    "id": "3",
    "title": "Video Editor",
    "description": "Location: [Your Office Location or Remote]<br />Team: Video Production<br />Experience Level: Mid Level<br /><br />🎬 About the Role<br />We are seeking a creative and detail-oriented Video Editor to craft cinematic reels, trailers, and promotional content that captivate and engage audiences.<br /><br />🔧 Responsibilities<br />Edit video footage using Adobe Premiere Pro and After Effects.<br />Create dynamic and visually appealing content for marketing, social media, and game trailers.<br />Collaborate with the creative team to understand project goals and deliver high-quality video edits.<br />Ensure timely delivery of projects while maintaining quality standards.<br /><br />🧠 Requirements<br />Proficiency in Adobe Premiere Pro and After Effects.<br />Experience in video editing for promotional or cinematic content.<br />Strong storytelling skills through video.<br />Ability to work under deadlines and manage multiple projects.<br />Good communication and teamwork skills.<br /><br />⭐ Nice to Have<br />Experience with motion graphics and visual effects.<br />Familiarity with audio editing and sound design."
  }
]
