[
  {
    "id": "1",
    "title": "Android Developer (Native) – IoT Projects",
  "description": "🚀 We’re Hiring: Android Developer (Native) – IoT Projects <br /> 📍 Location: Madurai<br /> At BEEYOOND GAMING, we are developing smart, connected solutions for the next generation of devices.<br /> We’re seeking a skilled Android Developer to join our IoT innovation team — where mobile meets hardware.<br /> If you're passionate about Android development and excited to work with connected devices, sensors, and embedded systems, this opportunity is for you.<br /><br /> <strong>Role Overview:</strong><br /> As an Android Developer focused on IoT integration, you’ll build intuitive mobile interfaces that control, monitor, and interact with a range of IoT devices. Your code will directly power real-world applications in smart home, industrial automation, healthcare tech, and beyond.<br /><br /> <strong>Key Responsibilities:</strong><br /> Develop native Android applications in Kotlin and/or Java<br /> Collaborate with IoT engineers and embedded system developers to connect mobile apps with smart devices<br /> Integrate wireless protocols: Bluetooth Low Energy (BLE), Wi-Fi, NFC, MQTT, etc.<br /> Design real-time data visualization and device management interfaces<br /> Optimize performance and battery usage in IoT use cases<br /> Ensure seamless user experience in connected environments<br /><br /> ✅ <strong>Requirements:</strong><br /> 2+ years of professional Android development experience<br /> Strong knowledge of Kotlin (preferred) or Java<br /> Proven experience integrating Android apps with IoT devices or hardware systems<br /> Familiarity with IoT protocols and tools (e.g., BLE, MQTT, WebSockets, Firebase)<br /> Experience working with APIs, device data, and background services<br /> Strong understanding of mobile performance, security, and connectivity issues<br /><br /> 📩 Interested? Let’s connect.<br /> Apply now by sending your resume to <a href=\"mailto:info@beeyoondgaming.com\">info@beeyoondgaming.com</a> or <a href=\"mailto:vignesh.hrbeeyoond@gmail.com\">vignesh.hrbeeyoond@gmail.com</a>"

  },
  {
    "id": "2",
    "title": "Unity Game Developer",
    "description": "Location: [Your Office Location or Remote]<br />Team: Game Development<br />Experience Level: Mid Level<br /><br />🎮 About the Role<br />We are looking for a skilled Unity Game Developer to join our dynamic team and help build engaging, immersive gaming experiences using Unity3D.<br /><br />🔧 Responsibilities<br />Develop, test, and maintain high-quality games and interactive experiences using Unity3D.<br />Collaborate with designers, artists, and other developers to implement game mechanics, UI, and features.<br />Optimize game performance across multiple platforms.<br />Troubleshoot and debug issues to ensure smooth gameplay.<br />Stay up-to-date with the latest gaming trends and technologies.<br /><br />🧠 Requirements<br />Strong proficiency in Unity3D and C# scripting.<br />Experience with game development lifecycle including design, implementation, and testing.<br />Understanding of 3D mathematics, physics, and animation principles.<br />Familiarity with version control systems (e.g., Git).<br />Ability to work well in a collaborative team environment.<br /><br />⭐ Preferred Qualifications<br />Experience with multiplayer networking and online game integration.<br />Knowledge of shader programming and optimization techniques.<br />Experience deploying games on multiple platforms (PC, mobile, consoles)."
  },
  {
    "id": "3",
    "title": "Video Editor",
    "description": "Location: [Your Office Location or Remote]<br />Team: Video Production<br />Experience Level: Mid Level<br /><br />🎬 About the Role<br />We are seeking a creative and detail-oriented Video Editor to craft cinematic reels, trailers, and promotional content that captivate and engage audiences.<br /><br />🔧 Responsibilities<br />Edit video footage using Adobe Premiere Pro and After Effects.<br />Create dynamic and visually appealing content for marketing, social media, and game trailers.<br />Collaborate with the creative team to understand project goals and deliver high-quality video edits.<br />Ensure timely delivery of projects while maintaining quality standards.<br /><br />🧠 Requirements<br />Proficiency in Adobe Premiere Pro and After Effects.<br />Experience in video editing for promotional or cinematic content.<br />Strong storytelling skills through video.<br />Ability to work under deadlines and manage multiple projects.<br />Good communication and teamwork skills.<br /><br />⭐ Nice to Have<br />Experience with motion graphics and visual effects.<br />Familiarity with audio editing and sound design."
  }
]